app/controllers/notes_controller.rb

  def show
    @note = Note.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "980190962"]]

  def edit
    @note = Note.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "980190962"]]

  def create
    @note = Note.new(params[:note])

    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "MyText"], ["created_at", Wed, 03 Aug 2011 12:59:49 UTC +00:00], ["title", "MyString"], ["updated_at", Wed, 03 Aug 2011 12:59:49 UTC +00:00]]

  def update
    @note = Note.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "980190962"]]

  def destroy
    @note = Note.find(params[:id])
    @note.destroy
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 980190962]]